adafruit/seesaw/lib/samd21/samd21d/edc/ATSAMD21G17L.PIC
      <edc:SFRDef edc:_addr="0x42002828" edc:access="------------nnnnnnnnnn------nnnn" edc:cname="INTENSET" edc:impl="0xFFC0F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRG" edc:desc="Retrigger Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNT" edc:desc="Counter Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="UFS" edc:desc="Non-Recoverable Update Fault Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFS" edc:desc="Non-Recoverable Debug Fault Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTA" edc:desc="Recoverable Fault A Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTB" edc:desc="Recoverable Fault B Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT0" edc:desc="Non-Recoverable Fault 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT1" edc:desc="Non-Recoverable Fault 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC0" edc:desc="Match or Capture Channel 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC1" edc:desc="Match or Capture Channel 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC2" edc:desc="Match or Capture Channel 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC3" edc:desc="Match or Capture Channel 3 Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200282C" edc:access="------------nnnnnnnnnn------nnnn" edc:cname="INTFLAG" edc:impl="0xFFC0F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRG" edc:desc="Retrigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNT" edc:desc="Counter" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="Error" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="UFS" edc:desc="Non-Recoverable Update Fault" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFS" edc:desc="Non-Recoverable Debug Fault" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTA" edc:desc="Recoverable Fault A" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTB" edc:desc="Recoverable Fault B" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT0" edc:desc="Non-Recoverable Fault 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT1" edc:desc="Non-Recoverable Fault 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC0" edc:desc="Match or Capture 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC1" edc:desc="Match or Capture 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC2" edc:desc="Match or Capture 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC3" edc:desc="Match or Capture 3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002830" edc:access="----nnnn----nnnnnnnnnnnnnnnnnnnn" edc:cname="STATUS" edc:impl="0xF0FFFFF" edc:mclr="00000000000000000000000000000001" edc:nzwidth="0x20" edc:por="00000000000000000000000000000001" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="STOP" edc:desc="Stop" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDX" edc:desc="Ramp" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UFS" edc:desc="Non-Recoverable Update Fault State" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFS" edc:desc="Non-Recoverable Debug Fault State" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLAVE" edc:desc="Slave" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PATTBV" edc:desc="Pattern Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAVEBV" edc:desc="Wave Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERBV" edc:desc="Period Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTAIN" edc:desc="Recoverable Fault A Input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTBIN" edc:desc="Recoverable Fault B Input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT0IN" edc:desc="Non-Recoverable Fault0 Input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT1IN" edc:desc="Non-Recoverable Fault1 Input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTA" edc:desc="Recoverable Fault A State" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTB" edc:desc="Recoverable Fault B State" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT0" edc:desc="Non-Recoverable Fault 0 State" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT1" edc:desc="Non-Recoverable Fault 1 State" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCBV0" edc:desc="Compare Channel 0 Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCBV1" edc:desc="Compare Channel 1 Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCBV2" edc:desc="Compare Channel 2 Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCBV3" edc:desc="Compare Channel 3 Buffer Valid" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMP0" edc:desc="Compare Channel 0 Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP1" edc:desc="Compare Channel 1 Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP2" edc:desc="Compare Channel 2 Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP3" edc:desc="Compare Channel 3 Value" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
